# https://www.codewars.com/kata/567de8823fa5eee02100002a
def whitespace(string):
    return string.strip() == ''Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
Домашнее задание № 4. Тема «Условный оператор if else. Тернарный оператор».
1.	В переменную name введите имя. Определите, начинается ли имя с гласной буквы.
2.	С помощью команды  input введите имя пользователя name. Если имя содержит более 5 букв, напечатайте "Your name is long!". В противном случае напечатайте  "Your name is short!"
3.	С помощью команды  input введите имя пользователя name и время time в часах от 0 до 24.  
•	Если время от 0 до 6 (включительно), напечатайте "Good night, name";
•	если время от 7 до 11 (включительно), напечатайте "Good morning, name";
•	если время от 12 до 18 (включительно), напечатайте "Good day, name";
•	если время от 19 до 24 (включительно), напечатайте "Good evening, name";
•	иначе напечатайте "Wrong time".
4.	Введите цену товара price.
•	Если price >= 300, вы получаете скидку 30%;
•	иначе если price >= 200, вы получаете скидку 20%;
•	иначе если price >= 100, вы получаете скидку 10%;
•	если цена меньше 100, скидки нет. Найдите итоговую стоимость товара.
5.	Введите возраст человека age. 
•	Если age<16 напечатайте "children";
•	иначе если 16<=age<50 напечатайте "young man"; 
•	иначе напечатайте "senior".
6.	В переменную current_color введите цвет сигнала светофора ('red','yellow','green'). Напечатайте следующий цвет сигнала светофора (смена цветов такая: 'red' ---> 'green', 'green' ---> 'yellow', 'yellow' ---> 'red').

Тернарный оператор
7.	Дана переменная num_of_day, хранящая номер дня недели. Присвоить переменой day значение “ Weekend”, если номер дня 6 или 7, и “Work day” в противном случае. Выполните это задание с использованием тернарного оператора.
8.	Дано число n. Число является "счастливым", если оно делится на 9. Присвойте переменной is_lucky значение "Lucky number", если число делится на 9, и "Not a lucky number" в противном случае. Выполните это задание с использованием тернарного оператора.
